2018/python-special-method.org
#+TITLE:      Python 魔法方法
#+AUTHOR:     rgb_24bit
#+EMAIL:      rgb-24bit@foxmail.com
#+DATE:       <2018-04-03 周二>

* 目录                                                    :TOC_4_gh:noexport:
- [[#简介][简介]]
- [[#构造和初始化][构造和初始化]]
- [[#比较和数值运算][比较和数值运算]]
  - [[#用于比较的魔法方法][用于比较的魔法方法]]
  - [[#数值处理的魔法方法][数值处理的魔法方法]]
- [[#类型转化][类型转化]]
- [[#表现类][表现类]]
- [[#属性访问控制][属性访问控制]]
- [[#创建定制的序列][创建定制的序列]]
- [[#反射][反射]]
- [[#可以调用的对象][可以调用的对象]]
- [[#上下文管理器][上下文管理器]]
- [[#更多的方法][更多的方法]]
- [[#参考链接][参考链接]]

* 简介
  在 ~Python~ 中， 你可以通过定义一些特殊的方法来控制一个对象的行为。

  这些方法的名字常用名为 *魔法方法* 或 *魔术方法*.

  当然了， 官方文档的名字更加直接， 叫做 *Special method*.
  
  这篇博客主要借鉴 [[http://pycoders-weekly-chinese.readthedocs.io/en/latest/issue6/a-guide-to-pythons-magic-methods.html][Python 魔术方法指南]] 对 *部分* 魔法方法进行总结。

* 构造和初始化
  ~Python~ 一个对象实例化到销毁调用的方法的顺序是：
  : __new__() ==> __init__() ==> ... ==> __del__()

  因为最常用的方法是 ~__init__()~, 所以我一直认为最先调用的方法应该是 ~__init__()~,
  但结果居然还有一个 ~__new__()~. 没人气的方法 *@_@*.

  + __new__(cls[,...])) :: 对象实例化的时候所调用的第一个方法， 它的第一个参数是这个类，
       其他的参数是用来直接传递给 ~__init__()~ 方法。

  + __init__(self[, ...]) :: 类的初始化方法。 可以说是最常用的方法了。 调用构造函数时
       的参数就是传给它的。

  + __del__(self) :: 当实例即将被销毁时调用， 也被叫做析构函数。 *没有参数*.

  #+BEGIN_SRC python :results output
    class Test(object):
        def __init__(self):
            print("Hello World !")

        def __del__(self):
            print("Goodbye World QAQ")

    T = Test()
    del T
  #+END_SRC

* 比较和数值运算
  一个有趣的例子：
  #+BEGIN_SRC python
    # one list
    >>> l = [0]

    # one tuple
    >>> t = (1, )

    # list + tuple ?
    >>> l + t
    Traceback (most recent call last):
      File "<stdin>", line 1, in <module>
    TypeError: can only concatenate list (not "tuple") to list

    # list += tuple ?
    >>> l += t
    [0, 1]
  #+END_SRC

  一个列表直接加一个元组会出错， 而 ~+=~ 没有问题...

  当时我很疑惑， 有大佬给出了解答：
  ~l + t~ 对应的是 ~l.__add__(t)~ ，而 ~l += t~ 对应的是 ~l.__iadd__(t)~ ，实现可以是不同的.

  当然， 大佬还说了这样的代码学习可以，就不要在实际操作中用了。
  
** 用于比较的魔法方法
   + __cmp__(self, other) :: 最基本的用于比较的魔法方法， 现了所有的比较符号 *(<,==,!=,etc.)*. 如果 ~self < other~ 应该返回一个 *负数*, 如果
        ~self == other~ 应该返回 *0*, 如果 ~self > other~ 应该返回一个 *正数*.

   + __eq__(self, other) :: 定义了 ~==~ 行为， 相等返回 ~True~, 反之返回 ~False~. 

   + __ne__(self, other) :: 定义了 ~!=~ 行为， 不等返回 ~True~, 反之返回 ~False~. 

   + __lt__(self, other) :: 定义了 ~<~ 行为， 小于返回 ~True~, 反之返回 ~False~. 

   + __gt__(self, other) :: 定义了 ~>~ 行为， 大于返回 ~True~, 反之返回 ~False~. 

   #+BEGIN_SRC python
     class Word(str):
     '''存储单词的类，定义比较单词的几种方法'''

         def __new__(cls, word):
             # 注意我们必须要用到__new__方法，因为str是不可变类型
             # 所以我们必须在创建的时候将它初始化
             if ' ' in word:
                 print "Value contains spaces. Truncating to first space."
                 word = word[:word.index(' ')] #单词是第一个空格之前的所有字符
             return str.__new__(cls, word)

         def __gt__(self, other):
             return len(self) > len(other)
         def __lt__(self, other):
             return len(self) < len(other)
         def __ge__(self, other):
             return len(self) >= len(other)
         def __le__(self, other):
             return len(self) <= len(other)
   #+END_SRC

   这里就直接可耻的盗用 *指南* 的例子了。

