2018/python-special-method.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2018-08-12 周日 11:30 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python 魔法方法</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb_24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/org-html-theme-list/org-note/style/main.css"/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Python 魔法方法</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfc0afc1">1. 简介</a></li>
<li><a href="#org4fb6290">2. 构造和初始化</a></li>
<li><a href="#orgc66111c">3. 比较和数值运算</a>
<ul>
<li><a href="#org6d68f65">3.1. 用于比较的魔法方法</a></li>
<li><a href="#org15aa7df">3.2. 数值处理的魔法方法</a></li>
</ul>
</li>
<li><a href="#orgfab7ed9">4. 类型转化</a></li>
<li><a href="#orgc1e853f">5. 表现类</a></li>
<li><a href="#org46b3a93">6. 属性访问控制</a></li>
<li><a href="#org253171a">7. 创建定制的序列</a></li>
<li><a href="#org69b2881">8. 反射</a></li>
<li><a href="#org666421a">9. 可以调用的对象</a></li>
<li><a href="#orge4e2adf">10. 上下文管理器</a></li>
<li><a href="#orgbe38dfb">11. 更多的方法</a></li>
<li><a href="#org386b808">12. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfc0afc1" class="outline-2">
<h2 id="orgfc0afc1"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
在 <code>Python</code> 中， 你可以通过定义一些特殊的方法来控制一个对象的行为。
</p>

<p>
这些方法的名字常用名为 <b>魔法方法</b> 或 <b>魔术方法</b>.
</p>

<p>
当然了， 官方文档的名字更加直接， 叫做 <b>Special method</b>.
</p>

<p>
这篇博客主要借鉴 <a href="http://pycoders-weekly-chinese.readthedocs.io/en/latest/issue6/a-guide-to-pythons-magic-methods.html">Python 魔术方法指南</a> 对 <b>部分</b> 魔法方法进行总结。
</p>
</div>
</div>

<div id="outline-container-org4fb6290" class="outline-2">
<h2 id="org4fb6290"><span class="section-number-2">2</span> 构造和初始化</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>Python</code> 一个对象实例化到销毁调用的方法的顺序是：
</p>
<pre class="example">
__new__() ==&gt; __init__() ==&gt; ... ==&gt; __del__()

</pre>

<p>
因为最常用的方法是 <code>__init__()</code>, 所以我一直认为最先调用的方法应该是 <code>__init__()</code>,
但结果居然还有一个 <code>__new__()</code>. 没人气的方法 <b>@_@</b>.
</p>

<dl class="org-dl">
<dt>__new__(cls[,&#x2026;]))</dt><dd>对象实例化的时候所调用的第一个方法， 它的第一个参数是这个类，
其他的参数是用来直接传递给 <code>__init__()</code> 方法。</dd>

<dt>__init__(self[, &#x2026;])</dt><dd>类的初始化方法。 可以说是最常用的方法了。 调用构造函数时
的参数就是传给它的。</dd>

<dt>__del__(self)</dt><dd>当实例即将被销毁时调用， 也被叫做析构函数。 <b>没有参数</b>.</dd>
</dl>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Test</span>(<span style="font-weight: bold;">object</span>):
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Hello World !"</span>)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__del__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">"Goodbye World QAQ"</span>)

<span style="font-weight: bold; font-style: italic;">T</span> = Test()
<span style="font-weight: bold;">del</span> T
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc66111c" class="outline-2">
<h2 id="orgc66111c"><span class="section-number-2">3</span> 比较和数值运算</h2>
<div class="outline-text-2" id="text-3">
<p>
一个有趣的例子：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">one list</span>
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">l</span> = [0]

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">one tuple</span>
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">t</span> = (1, )

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">list + tuple ?</span>
&gt;&gt;&gt; l + t
Traceback (most recent call last):
  File <span style="font-style: italic;">"&lt;stdin&gt;"</span>, line 1, <span style="font-weight: bold;">in</span> &lt;module&gt;
<span style="font-weight: bold; text-decoration: underline;">TypeError</span>: can only concatenate <span style="font-weight: bold;">list</span> (<span style="font-weight: bold;">not</span> <span style="font-style: italic;">"tuple"</span>) to <span style="font-weight: bold;">list</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">list += tuple ?</span>
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">l</span> += t
[0, 1]
</pre>
</div>

<p>
一个列表直接加一个元组会出错， 而 <code>+=</code> 没有问题&#x2026;
</p>

<p>
当时我很疑惑， 有大佬给出了解答：
<code>l + t</code> 对应的是 <code>l.__add__(t)</code> ，而 <code>l += t</code> 对应的是 <code>l.__iadd__(t)</code> ，实现可以是不同的.
</p>

<p>
当然， 大佬还说了这样的代码学习可以，就不要在实际操作中用了。
</p>
</div>

<div id="outline-container-org6d68f65" class="outline-3">
<h3 id="org6d68f65"><span class="section-number-3">3.1</span> 用于比较的魔法方法</h3>
<div class="outline-text-3" id="text-3-1">
<dl class="org-dl">
<dt>__cmp__(self, other)</dt><dd>最基本的用于比较的魔法方法， 现了所有的比较符号 <b>(&lt;,==,!=,etc.)</b>. 如果 <code>self &lt; other</code> 应该返回一个 <b>负数</b>, 如果
<code>self == other</code> 应该返回 <b>0</b>, 如果 <code>self &gt; other</code> 应该返回一个 <b>正数</b>.</dd>

<dt>__eq__(self, other)</dt><dd>定义了 <code>==</code> 行为， 相等返回 <code>True</code>, 反之返回 <code>False</code>.</dd>

<dt>__ne__(self, other)</dt><dd>定义了 <code>!=</code> 行为， 不等返回 <code>True</code>, 反之返回 <code>False</code>.</dd>

<dt>__lt__(self, other)</dt><dd>定义了 <code>&lt;</code> 行为， 小于返回 <code>True</code>, 反之返回 <code>False</code>.</dd>

<dt>__gt__(self, other)</dt><dd>定义了 <code>&gt;</code> 行为， 大于返回 <code>True</code>, 反之返回 <code>False</code>.</dd>
</dl>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Word</span>(<span style="font-weight: bold;">str</span>):
<span style="font-style: italic;">'''&#23384;&#20648;&#21333;&#35789;&#30340;&#31867;&#65292;&#23450;&#20041;&#27604;&#36739;&#21333;&#35789;&#30340;&#20960;&#31181;&#26041;&#27861;'''</span>

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__new__</span>(cls, word):
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#27880;&#24847;&#25105;&#20204;&#24517;&#39035;&#35201;&#29992;&#21040;__new__&#26041;&#27861;&#65292;&#22240;&#20026;str&#26159;&#19981;&#21487;&#21464;&#31867;&#22411;</span>
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#25152;&#20197;&#25105;&#20204;&#24517;&#39035;&#22312;&#21019;&#24314;&#30340;&#26102;&#20505;&#23558;&#23427;&#21021;&#22987;&#21270;</span>
        <span style="font-weight: bold;">if</span> <span style="font-style: italic;">' '</span> <span style="font-weight: bold;">in</span> word:
            <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"Value contains spaces. Truncating to first space."</span>
            <span style="font-weight: bold; font-style: italic;">word</span> = word[:word.index(<span style="font-style: italic;">' '</span>)] <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">&#21333;&#35789;&#26159;&#31532;&#19968;&#20010;&#31354;&#26684;&#20043;&#21069;&#30340;&#25152;&#26377;&#23383;&#31526;</span>
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">str</span>.__new__(cls, word)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__gt__</span>(<span style="font-weight: bold;">self</span>, other):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>) &gt; <span style="font-weight: bold;">len</span>(other)
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__lt__</span>(<span style="font-weight: bold;">self</span>, other):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>) &lt; <span style="font-weight: bold;">len</span>(other)
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__ge__</span>(<span style="font-weight: bold;">self</span>, other):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>) &gt;= <span style="font-weight: bold;">len</span>(other)
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__le__</span>(<span style="font-weight: bold;">self</span>, other):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>) &lt;= <span style="font-weight: bold;">len</span>(other)
</pre>
</div>

<p>
这里就直接可耻的盗用 <b>指南</b> 的例子了。
</p>
</div>
</div>
