2018/python-special-method.org
** 数值处理的魔法方法
   + *一元操作符和函数* 
     + __pos__(self) :: 实现正号的特性, 如 ~+object~
     + __neg__(self) :: 实现负号的特性, 如 ~-object~
     + __abs__(self) :: 实现内置 ~abs()~ 函数的特性, 如 ~abs(object)~
     + __invert__(self) :: 实现 =~= 符号的特性, 参考文章: [[https://en.wikipedia.org/wiki/Bitwise_operation#NOT][Bitwise operation]]

   + *普通算数操作符*
     + __add__(self, other) :: 实现加法, 如 ~A + B~
     + __sub__(self, other) :: 实现减法, 如 ~A - B~
     + __mul__(self, other) :: 实现乘法, 如 ~A * B~
     + __floordiv__(self, other) :: 实现 ~//~ 除, 如 ~A // B~
     + __div__(self, other) :: 实现 ~/~ 除, 如 ~A / B~
     + __truediv__(self, other) :: 实现真除法， 需要：
          : from __future__ import division
     + __mod__(self, other) :: 实现取模运算, 如 ~A % B~
     + __divmod___(self, other) :: 实现内置函数 ~divmod()~ 运算, 如 ~divmod(obj)~
     + __pow___(self, other[, modulo]) :: 实现使用 ~**~ 的指数运算, 如 ~A**2~
     + __lshift__(self, other) :: 实现使用 ~<<~ 的按位左移运算, 如 ~A << B~
     + __rshift__(self, other) :: 实现使用 ~>>~ 的按位右移运算, 如 ~A >> B~
     + __and__(self, other) :: 实现使用 ~&~ 的按位与运算, 如 ~A & B~
     + __or__(self, other) :: 实现使用 ~|~ 的按位或运算, 如 ~A | B~
     + __xor__(self, other) :: 实现使用 ~^~ 的按位异或运算, 如 ~A ^ B~

   + *反运算*

     指南给出的反运算的解释：
     #+BEGIN_EXAMPLE
       一个普通的加法运算： some_object + other

       对应的反运算： other + some_object
     #+END_EXAMPLE

     意思就是把操作数调了个位置， 大多数情况下，反运算的结果是与普通运算相同的。

     具体的实现和 *普通算数操作符* 的实现差不多， 只需要在对应的运算前面加上一个 ~r~ 就可以了。

     如： ~__add__()~ 对应 ~__radd__()~.

     *Update 2018-05-14:* 突然明白反运算是什么意思了：
     + self + other 就是正运算
     + other + self 就是反运算

   + *增量赋值*

     这个就是比较熟悉的运算了， 就是类似于 ~A += B~ 的运算， 实现方式和 *普通算数操作符* 类似， 
     只需要在对应的运算前面加上一个 ~i~ 就可以了。

     如： ~__add__()~ 对应 ~__iadd__()~. 

     实际操作就是对应的运算符紧跟一个等号 ~=~.

     如： ~+=~, ~>>=~, ~**=~...

* 类型转化
  可以通过一些 *魔法方法* 来实现内置类型类型转换， 注意， 是转换为 *内置类型*. 
  + __int__(self) :: 实现整形的强制转换
  + __long__(self) :: 实现长整形的强制转换, 当然， 这应该是 ~Python2~ 的
  + __float__(self) :: 实现浮点型的强制转换
  + __complex__(self) :: 实现复数的强制转换
  + __oct__(self) :: 实现八进制的强制转换
  + __hex__(self) :: 实现二进制的强制转换
  + __index__(self) :: 当对象是被应用在 *切片表达式* 中时，实现整形强制转换
  + __trunc__(self) :: 当使用 ~math.trunc(self)~ 的时候被调用, 应该返回数值被截取成整形的值
  + __coerce__(self, other) :: 实现混合模式算数, 也是 ~Python2~ 的

  转换成什么类型就返回什么类型的值。

* 表现类
  + __str__(self) :: 使用 ~str(obj)~ 会调用这个方法
  + __repr__(self) :: 使用 ~repr(obj)~ 会调用这个方法
  + __unicode(self) :: 使用 ~unicode(obj)~ 会调用这个方法， 当然这也是 ~Python2~ 的
  + __hash__(self) :: 使用 ~hash(obj)~ 会调用这个方法， 应该返回一个 *整型*
  + __nonzero(self) :: 使用 ~bool(obj)~ 会调用这个方法， 应该返回 ~True~ 或 ~False~.
       在 ~Python3~ 中改为了 ~__bool__().~
       
* 属性访问控制
  作为动态语言， ~Python~ 一个对象的属性的访问是很开放的。 如果需要对属性的访问进行控制，
  就可以使用这一部分的 *魔法方法*.

  + __getattr__(self, name) :: 获取不存在的属性的值时会调用这个方法， 所以在这个方法内可以
       获取正常属性的值。

  + __getattribute__(self, name) :: 获取对象的属性时调用， 不管属性存不存在。 同时如果定义了这个方法， ~__getattr__~ 将
       不起作用， 除非显示调用或引发 ~AttributeError~.

       由于获取任意属性都将调用这一方法， 所以如果在这个方法内获取属性将导致 *无限递归*.

       解决这一问题的方法是把获取属性的方法指向一个更高的 *超类*:
       #+BEGIN_SRC python
         class ClassA:
             def __getattribute__(self, item):
                 return super().__getattribute__(self, item)
       #+END_SRC

  + __setattr__(self, name, value) :: 定义设置对象的属性时的行为， 即 ~obj.xxx = xxx~ 时会调用这个方法

       使用这个方法需要注意的一点：
       #+BEGIN_SRC python
         def __setattr__(self, name, value):
             self.name = value
             # 每当属性被赋值的时候， ``__setattr__()`` 会被调用，这样就造成了递归调用
             # 这意味这会调用 ``self.__setattr__('name', value)`` ，每次方法会调用自己。这样会造成程序崩溃

         def __setattr__(self, name, value):
             # 通过这种方式来避免
             self.__dict__[name] = value  # 给类中的属性名分配值
       #+END_SRC

       设置 *实例* 属性会调用这个方法， 包括在 ~__init__~ 中设置属性。 但类属性不受影响。

  + __delattr__(self, name) :: 定义删除对象的属性时的行为， 即 ~del obj.xxx~ 时会调用这个方法

  对于这一部分的 *魔法方法*, 每个 *对象* 的 ~__dict__~ 属性应该是一个很重要的内容， 有兴趣可以
  了解一下 ☞ [[https://docs.python.org/3/library/stdtypes.html?highlight=__dict__#object.__dict__][object.__dict__]].

* 创建定制的序列
  ~Python~ 中的序列有 *可变* 和 *不可变* 的区分， 比如 ~tuple~ 和 ~list~.

  通过魔法方法的定义来控制创建的序列的类型：
  + *不可变*: 只能定义 ~__len__~ 和 ~__getitem__~.
  + *可变*: 需要定义 ~__setitem__~ 和 ~__delitem__~.
  + *可迭代*: 需要定义 ~__iter__~ 返回一个迭代器

  这些魔法方法的具体作用：
  + __len__(self) :: 使用 ~len(obj)~ 的时候调用， 返回序列的长度
  + __getitem__(self, key) :: 使用 ~obj[key]~ 时调用， 返回序列指定键的值
  + __setitem__(self, key, value) :: 使用 ~obj[key] = value~ 时调用， 设置序列指定键的值
  + __delitem__(self, key) :: 使用 ~del obj[key]~ 时调用， 删除序列指定条目
  + __iter__(self) :: 返回迭代器， ~iter(obj)~
  + __reversed__(self) :: 使用 ~reversed(obi)~ 时调用， 反转序列
  + __contains__(self, item) :: 使用 ~item in obj~ 和 ~item not in obj~ 时调用， 检测成员是否存在
  + __concat__(self, other) :: 连接两个序列的时候调用

* 反射
  通过魔法方法控制使用 ~isinstance~ 和 ~issubclass~ 的反射行为：
  + __instancecheck__(self, instance) :: 检查一个实例是不是定义的类的实例, 对应 ~isinstance~
  + __subclasscheck__(self, subclass) :: 检查一个类是不是定义的类的子类, 对应 ~issubclass~
  
