2018/python-special-method.html

<div id="outline-container-org15aa7df" class="outline-3">
<h3 id="org15aa7df"><span class="section-number-3">3.2</span> 数值处理的魔法方法</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li><b>一元操作符和函数</b> 
<dl class="org-dl">
<dt>__pos__(self)</dt><dd>实现正号的特性, 如 <code>+object</code></dd>
<dt>__neg__(self)</dt><dd>实现负号的特性, 如 <code>-object</code></dd>
<dt>__abs__(self)</dt><dd>实现内置 <code>abs()</code> 函数的特性, 如 <code>abs(object)</code></dd>
<dt>__invert__(self)</dt><dd>实现 <code>~</code> 符号的特性, 参考文章: <a href="https://en.wikipedia.org/wiki/Bitwise_operation#NOT">Bitwise operation</a></dd>
</dl></li>

<li><b>普通算数操作符</b>
<dl class="org-dl">
<dt>__add__(self, other)</dt><dd>实现加法, 如 <code>A + B</code></dd>
<dt>__sub__(self, other)</dt><dd>实现减法, 如 <code>A - B</code></dd>
<dt>__mul__(self, other)</dt><dd>实现乘法, 如 <code>A * B</code></dd>
<dt>__floordiv__(self, other)</dt><dd>实现 <code>//</code> 除, 如 <code>A // B</code></dd>
<dt>__div__(self, other)</dt><dd>实现 <code>/</code> 除, 如 <code>A / B</code></dd>
<dt>__truediv__(self, other)</dt><dd><p>
实现真除法， 需要：
</p>
<pre class="example">
from __future__ import division

</pre></dd>
<dt>__mod__(self, other)</dt><dd>实现取模运算, 如 <code>A % B</code></dd>
<dt>__divmod___(self, other)</dt><dd>实现内置函数 <code>divmod()</code> 运算, 如 <code>divmod(obj)</code></dd>
<dt>__pow___(self, other[, modulo])</dt><dd>实现使用 <code>**</code> 的指数运算, 如 <code>A**2</code></dd>
<dt>__lshift__(self, other)</dt><dd>实现使用 <code>&lt;&lt;</code> 的按位左移运算, 如 <code>A &lt;&lt; B</code></dd>
<dt>__rshift__(self, other)</dt><dd>实现使用 <code>&gt;&gt;</code> 的按位右移运算, 如 <code>A &gt;&gt; B</code></dd>
<dt>__and__(self, other)</dt><dd>实现使用 <code>&amp;</code> 的按位与运算, 如 <code>A &amp; B</code></dd>
<dt>__or__(self, other)</dt><dd>实现使用 <code>|</code> 的按位或运算, 如 <code>A | B</code></dd>
<dt>__xor__(self, other)</dt><dd>实现使用 <code>^</code> 的按位异或运算, 如 <code>A ^ B</code></dd>
</dl></li>

<li><p>
<b>反运算</b>
</p>

<p>
指南给出的反运算的解释：
</p>
<pre class="example">
       一个普通的加法运算： some_object + other

       对应的反运算： other + some_object
</pre>

<p>
意思就是把操作数调了个位置， 大多数情况下，反运算的结果是与普通运算相同的。
</p>

<p>
具体的实现和 <b>普通算数操作符</b> 的实现差不多， 只需要在对应的运算前面加上一个 <code>r</code> 就可以了。
</p>

<p>
如： <code>__add__()</code> 对应 <code>__radd__()</code>.
</p>

<p>
<b>Update 2018-05-14:</b> 突然明白反运算是什么意思了：
</p>
<ul class="org-ul">
<li>self + other 就是正运算</li>
<li>other + self 就是反运算</li>
</ul></li>

<li><p>
<b>增量赋值</b>
</p>

<p>
这个就是比较熟悉的运算了， 就是类似于 <code>A += B</code> 的运算， 实现方式和 <b>普通算数操作符</b> 类似， 
只需要在对应的运算前面加上一个 <code>i</code> 就可以了。
</p>

<p>
如： <code>__add__()</code> 对应 <code>__iadd__()</code>. 
</p>

<p>
实际操作就是对应的运算符紧跟一个等号 <code>=</code>.
</p>

<p>
如： <code>+=</code>, <code>&gt;&gt;=</code>, <code>**=</code>&#x2026;
</p></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfab7ed9" class="outline-2">
<h2 id="orgfab7ed9"><span class="section-number-2">4</span> 类型转化</h2>
<div class="outline-text-2" id="text-4">
<p>
可以通过一些 <b>魔法方法</b> 来实现内置类型类型转换， 注意， 是转换为 <b>内置类型</b>. 
</p>
<dl class="org-dl">
<dt>__int__(self)</dt><dd>实现整形的强制转换</dd>
<dt>__long__(self)</dt><dd>实现长整形的强制转换, 当然， 这应该是 <code>Python2</code> 的</dd>
<dt>__float__(self)</dt><dd>实现浮点型的强制转换</dd>
<dt>__complex__(self)</dt><dd>实现复数的强制转换</dd>
<dt>__oct__(self)</dt><dd>实现八进制的强制转换</dd>
<dt>__hex__(self)</dt><dd>实现二进制的强制转换</dd>
<dt>__index__(self)</dt><dd>当对象是被应用在 <b>切片表达式</b> 中时，实现整形强制转换</dd>
<dt>__trunc__(self)</dt><dd>当使用 <code>math.trunc(self)</code> 的时候被调用, 应该返回数值被截取成整形的值</dd>
<dt>__coerce__(self, other)</dt><dd>实现混合模式算数, 也是 <code>Python2</code> 的</dd>
</dl>

<p>
转换成什么类型就返回什么类型的值。
</p>
</div>
</div>

<div id="outline-container-orgc1e853f" class="outline-2">
<h2 id="orgc1e853f"><span class="section-number-2">5</span> 表现类</h2>
<div class="outline-text-2" id="text-5">
<dl class="org-dl">
<dt>__str__(self)</dt><dd>使用 <code>str(obj)</code> 会调用这个方法</dd>
<dt>__repr__(self)</dt><dd>使用 <code>repr(obj)</code> 会调用这个方法</dd>
<dt>__unicode(self)</dt><dd>使用 <code>unicode(obj)</code> 会调用这个方法， 当然这也是 <code>Python2</code> 的</dd>
<dt>__hash__(self)</dt><dd>使用 <code>hash(obj)</code> 会调用这个方法， 应该返回一个 <b>整型</b></dd>
<dt>__nonzero(self)</dt><dd>使用 <code>bool(obj)</code> 会调用这个方法， 应该返回 <code>True</code> 或 <code>False</code>.
在 <code>Python3</code> 中改为了 <code>__bool__().</code></dd>
</dl>
</div>
</div>

<div id="outline-container-org46b3a93" class="outline-2">
<h2 id="org46b3a93"><span class="section-number-2">6</span> 属性访问控制</h2>
<div class="outline-text-2" id="text-6">
<p>
作为动态语言， <code>Python</code> 一个对象的属性的访问是很开放的。 如果需要对属性的访问进行控制，
就可以使用这一部分的 <b>魔法方法</b>.
</p>

<dl class="org-dl">
<dt>__getattr__(self, name)</dt><dd>获取不存在的属性的值时会调用这个方法， 所以在这个方法内可以
获取正常属性的值。</dd>

<dt>__getattribute__(self, name)</dt><dd><p>
获取对象的属性时调用， 不管属性存不存在。 同时如果定义了这个方法， <code>__getattr__</code> 将
不起作用， 除非显示调用或引发 <code>AttributeError</code>.
</p>

<p>
由于获取任意属性都将调用这一方法， 所以如果在这个方法内获取属性将导致 <b>无限递归</b>.
</p>

<p>
解决这一问题的方法是把获取属性的方法指向一个更高的 <b>超类</b>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">ClassA</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__getattribute__</span>(<span style="font-weight: bold;">self</span>, item):
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">super</span>().__getattribute__(<span style="font-weight: bold;">self</span>, item)
</pre>
</div></dd>

<dt>__setattr__(self, name, value)</dt><dd><p>
定义设置对象的属性时的行为， 即 <code>obj.xxx = xxx</code> 时会调用这个方法
</p>

<p>
使用这个方法需要注意的一点：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__setattr__</span>(<span style="font-weight: bold;">self</span>, name, value):
    <span style="font-weight: bold;">self</span>.name = value
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#27599;&#24403;&#23646;&#24615;&#34987;&#36171;&#20540;&#30340;&#26102;&#20505;&#65292; ``__setattr__()`` &#20250;&#34987;&#35843;&#29992;&#65292;&#36825;&#26679;&#23601;&#36896;&#25104;&#20102;&#36882;&#24402;&#35843;&#29992;</span>
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#36825;&#24847;&#21619;&#36825;&#20250;&#35843;&#29992; ``self.__setattr__('name', value)`` &#65292;&#27599;&#27425;&#26041;&#27861;&#20250;&#35843;&#29992;&#33258;&#24049;&#12290;&#36825;&#26679;&#20250;&#36896;&#25104;&#31243;&#24207;&#23849;&#28291;</span>

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__setattr__</span>(<span style="font-weight: bold;">self</span>, name, value):
    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#36890;&#36807;&#36825;&#31181;&#26041;&#24335;&#26469;&#36991;&#20813;</span>
    <span style="font-weight: bold;">self</span>.__dict__[name] = value  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#32473;&#31867;&#20013;&#30340;&#23646;&#24615;&#21517;&#20998;&#37197;&#20540;</span>
</pre>
</div>

<p>
设置 <b>实例</b> 属性会调用这个方法， 包括在 <code>__init__</code> 中设置属性。 但类属性不受影响。
</p></dd>

<dt>__delattr__(self, name)</dt><dd>定义删除对象的属性时的行为， 即 <code>del obj.xxx</code> 时会调用这个方法</dd>
</dl>

<p>
对于这一部分的 <b>魔法方法</b>, 每个 <b>对象</b> 的 <code>__dict__</code> 属性应该是一个很重要的内容， 有兴趣可以
了解一下 ☞ <a href="https://docs.python.org/3/library/stdtypes.html?highlight=__dict__#object.__dict__">object.__dict__</a>.
</p>
</div>
</div>

<div id="outline-container-org253171a" class="outline-2">
<h2 id="org253171a"><span class="section-number-2">7</span> 创建定制的序列</h2>
<div class="outline-text-2" id="text-7">
<p>
<code>Python</code> 中的序列有 <b>可变</b> 和 <b>不可变</b> 的区分， 比如 <code>tuple</code> 和 <code>list</code>.
</p>

<p>
通过魔法方法的定义来控制创建的序列的类型：
</p>
<ul class="org-ul">
<li><b>不可变</b>: 只能定义 <code>__len__</code> 和 <code>__getitem__</code>.</li>
<li><b>可变</b>: 需要定义 <code>__setitem__</code> 和 <code>__delitem__</code>.</li>
<li><b>可迭代</b>: 需要定义 <code>__iter__</code> 返回一个迭代器</li>
</ul>

<p>
这些魔法方法的具体作用：
</p>
<dl class="org-dl">
<dt>__len__(self)</dt><dd>使用 <code>len(obj)</code> 的时候调用， 返回序列的长度</dd>
<dt>__getitem__(self, key)</dt><dd>使用 <code>obj[key]</code> 时调用， 返回序列指定键的值</dd>
<dt>__setitem__(self, key, value)</dt><dd>使用 <code>obj[key] = value</code> 时调用， 设置序列指定键的值</dd>
<dt>__delitem__(self, key)</dt><dd>使用 <code>del obj[key]</code> 时调用， 删除序列指定条目</dd>
<dt>__iter__(self)</dt><dd>返回迭代器， <code>iter(obj)</code></dd>
<dt>__reversed__(self)</dt><dd>使用 <code>reversed(obi)</code> 时调用， 反转序列</dd>
<dt>__contains__(self, item)</dt><dd>使用 <code>item in obj</code> 和 <code>item not in obj</code> 时调用， 检测成员是否存在</dd>
<dt>__concat__(self, other)</dt><dd>连接两个序列的时候调用</dd>
</dl>
</div>
</div>

<div id="outline-container-org69b2881" class="outline-2">
<h2 id="org69b2881"><span class="section-number-2">8</span> 反射</h2>
<div class="outline-text-2" id="text-8">
<p>
通过魔法方法控制使用 <code>isinstance</code> 和 <code>issubclass</code> 的反射行为：
</p>
<dl class="org-dl">
<dt>__instancecheck__(self, instance)</dt><dd>检查一个实例是不是定义的类的实例, 对应 <code>isinstance</code></dd>
<dt>__subclasscheck__(self, subclass)</dt><dd>检查一个类是不是定义的类的子类, 对应 <code>issubclass</code></dd>
</dl>
</div>
</div>
